karateapi/src/test/java/resources/xmlRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://soa.delta.com/equipment/v1" xmlns:v4="http://schemas.delta.com/common/requestinfo/v4" xmlns:v11="http://schemas.delta.com/equipment/equipmentrequesttypes/v1"> <soapenv:Header/> <soapenv:Body> <v1:RetrieveIndustryAircraftTypesRequest> <v4:RequestInfo AppChannelName="?" ApplicationId="?"></v4:RequestInfo> </v1:RetrieveIndustryAircraftTypesRequest> </soapenv:Body> </soapenv:Envelope>